In [1]:
import pandas as pd
import numpy as np
import sqlite3

In [2]:
conn = sqlite3.connect("test.db")
print("Database connected successfully")

Database connected successfully

In [3]:
# conn.execute('''CREATE TABLE Manufacturers (
#   Code INTEGER,
#   Name VARCHAR(255) NOT NULL,
#   PRIMARY KEY (Code)   
# );''')
# print("Manufacturers table created successfully")

In [4]:
# conn.execute('''CREATE TABLE Products (
#   Code INTEGER,
#   Name VARCHAR(255) NOT NULL ,
#   Price DECIMAL NOT NULL ,
#   Manufacturer INTEGER NOT NULL,
#   PRIMARY KEY (Code), 
#   FOREIGN KEY (Manufacturer) REFERENCES Manufacturers(Code)
# );''')

# print("Products table created successfully")

In [5]:
# conn.execute('''INSERT INTO Manufacturers(Code,Name) VALUES(1,'Sony');''')
# conn.execute('''INSERT INTO Manufacturers(Code,Name) VALUES(2,'Creative Labs');''')
# conn.execute('''INSERT INTO Manufacturers(Code,Name) VALUES(3,'Hewlett-Packard');''')
# conn.execute('''INSERT INTO Manufacturers(Code,Name) VALUES(4,'Iomega');''')
# conn.execute('''INSERT INTO Manufacturers(Code,Name) VALUES(5,'Fujitsu');''')
# conn.execute('''INSERT INTO Manufacturers(Code,Name) VALUES(6,'Winchester');''')
# conn.commit()
# print("Inserted records into manufacturers table successfully")

In [6]:
# conn.execute('''INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(1,'Hard drive',240,5);''')
# conn.execute('''INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(2,'Memory',120,6);''')
# conn.execute('''INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(3,'ZIP drive',150,4);''')
# conn.execute('''INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(4,'Floppy disk',5,6);''')
# conn.execute('''INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(5,'Monitor',240,1);''')
# conn.execute('''INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(6,'DVD drive',180,2);''')
# conn.execute('''INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(7,'CD drive',90,2);''')
# conn.execute('''INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(8,'Printer',270,3);''')
# conn.execute('''INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(9,'Toner cartridge',66,3);''')
# conn.execute('''INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(10,'DVD burner',180,2);''')
# conn.commit()
# print("Inserted records into products table successfully")

## QUESTIONS

1.1 Select the names of all the products in the store.

In [7]:
df = pd.read_sql_query("select Name from Products;",conn)
df

               Name
0        Hard drive
1            Memory
2         ZIP drive
3       Floppy disk
4           Monitor
5         DVD drive
6          CD drive
7     Laser Printer
8   Toner cartridge
9        DVD burner
10     Loudspeakers

1.2 Select the names and the prices of all the products in the store.

In [8]:
df = pd.read_sql_query("select Name, Price from Products;",conn)
df

               Name  Price
0        Hard drive    216
1            Memory    108
2         ZIP drive    135
3       Floppy disk      5
4           Monitor    216
5         DVD drive    162
6          CD drive     90
7     Laser Printer    243
8   Toner cartridge     66
9        DVD burner    162
10     Loudspeakers     70

1.3 Select the name of the products with a price less than or equal to $200.

In [9]:
df = pd.read_sql_query("select Name from Products where Price<=200;",conn)
df

              Name
0           Memory
1        ZIP drive
2      Floppy disk
3        DVD drive
4         CD drive
5  Toner cartridge
6       DVD burner
7     Loudspeakers

1.4 Select all the products with a price between $60 and $120.

In [10]:
df = pd.read_sql_query("select * from products where price >= 60 and price <= 120;",conn)
df

   Code             Name  Price  Manufacturer
0     2           Memory    108             6
1     7         CD drive     90             2
2     9  Toner cartridge     66             3
3    11     Loudspeakers     70             2

1.5 Select the name and price in cents (i.e., the price must be multiplied by 100)

In [11]:
df = pd.read_sql_query("select Name,(Price*100) from Products;",conn)
df

               Name  (Price*100)
0        Hard drive        21600
1            Memory        10800
2         ZIP drive        13500
3       Floppy disk          500
4           Monitor        21600
5         DVD drive        16200
6          CD drive         9000
7     Laser Printer        24300
8   Toner cartridge         6600
9        DVD burner        16200
10     Loudspeakers         7000

1.6 Compute the average price of all the products

In [12]:
df = pd.read_sql_query("select avg(Price) from Products;",conn)
df

   avg(Price)
0  133.909091

1.7 Compute the average price of all products with manufacturer code equal to 2.

In [13]:
df = pd.read_sql_query("select avg(Price) from Products where Manufacturer =2;",conn)
df

   avg(Price)
0       121.0

1.8 Compute the number of products with a price larger than or equal to $180.

In [14]:
df = pd.read_sql_query("select count(*) from Products where Price>=180;",conn)
df

   count(*)
0         3

1.9 Select the name and price of all products with a price larger than or equal to $180, and sort first by price (in descending order), and then by name (in ascending order)

In [15]:
df1 = pd.read_sql_query("select Name,Price from Products where Price>=180 order by Price desc,Name asc;",conn)
df1

            Name  Price
0  Laser Printer    243
1     Hard drive    216
2        Monitor    216

1.10 Select all the data from the products, including all the data for each product's manufacturer.

In [16]:
df1 = pd.read_sql_query("select a.*,b.Name from Products a join Manufacturers b on a.Manufacturer=b.Code;",conn)
df1

    Code             Name  Price  Manufacturer             Name
0      1       Hard drive    216             5          Fujitsu
1      2           Memory    108             6       Winchester
2      3        ZIP drive    135             4           Iomega
3      4      Floppy disk      5             6       Winchester
4      5          Monitor    216             1             Sony
5      6        DVD drive    162             2    Creative Labs
6      7         CD drive     90             2    Creative Labs
7      8    Laser Printer    243             3  Hewlett-Packard
8      9  Toner cartridge     66             3  Hewlett-Packard
9     10       DVD burner    162             2    Creative Labs
10    11     Loudspeakers     70             2    Creative Labs

1.11 Select the product name, price, and manufacturer name of all the products.

In [17]:
df1 = pd.read_sql_query("select a.Name, a.Price, b.Name from Products a join Manufacturers b on a.Manufacturer=b.Code;",conn)
df1

               Name  Price             Name
0        Hard drive    216          Fujitsu
1            Memory    108       Winchester
2         ZIP drive    135           Iomega
3       Floppy disk      5       Winchester
4           Monitor    216             Sony
5         DVD drive    162    Creative Labs
6          CD drive     90    Creative Labs
7     Laser Printer    243  Hewlett-Packard
8   Toner cartridge     66  Hewlett-Packard
9        DVD burner    162    Creative Labs
10     Loudspeakers     70    Creative Labs

1.12 Select the average price of each manufacturer's products, showing only the manufacturer's code.

In [18]:
df1 = pd.read_sql_query("select avg(Price), Manufacturer from Products group by Manufacturer;",conn)
df1

   avg(Price)  Manufacturer
0       216.0             1
1       121.0             2
2       154.5             3
3       135.0             4
4       216.0             5
5        56.5             6

1.13 Select the average price of each manufacturer's products, showing the manufacturer's name.

In [19]:
df1 = pd.read_sql_query("select avg(a.Price),b.Name from Products a join Manufacturers b on a.Manufacturer=b.Code group by b.Name;",conn)
df1

   avg(a.Price)             Name
0         121.0    Creative Labs
1         216.0          Fujitsu
2         154.5  Hewlett-Packard
3         135.0           Iomega
4         216.0             Sony
5          56.5       Winchester

1.14 Select the names of manufacturer whose products have an average price larger than or equal to $150.

In [20]:
df1 = pd.read_sql_query("select avg(a.Price),b.Name from Products a join Manufacturers b on a.Manufacturer=b.Code group by b.Name having avg(a.Price)>=150;",conn)
df1

   avg(a.Price)             Name
0         216.0          Fujitsu
1         154.5  Hewlett-Packard
2         216.0             Sony

1.15 Select the name and price of the cheapest product.

In [21]:
df1 = pd.read_sql_query("select Name,Price from Products where Price=(Select min(Price) from Products);",conn)
df1

          Name  Price
0  Floppy disk      5

In [22]:
df1 = pd.read_sql_query("select Name,Price from Products order by Price asc limit 1;",conn) #using order by clause
df1

          Name  Price
0  Floppy disk      5

1.17 Add a new product: Loudspeakers, $70, manufacturer 2.

In [24]:
# conn.execute('''INSERT INTO Products(Code,Name,Price,Manufacturer) VALUES(11,'Loudspeakers',70,2);''')
# conn.commit()

1.18 Update the name of product 8 to "Laser Printer".

In [25]:
conn.execute("update Products set Name='Laser Printer' where Code = 8;") #using order by clause
conn.commit()

1.20 Apply a 10% discount to all products with a price larger than or equal to $120.

In [26]:
conn.execute("update Products set Price=Price * 0.9 where Price>=120;") #using order by clause
conn.commit()